app/Controllers/AuthController.php

SELECT *
FROM `usuarios`
WHERE `login` = 'admin'
AND `ativo` = 1
 LIMIT 1
---
    public function autenticar()
    {
        $session = session();
        $model = new UsuarioModel();

        // Recupera dados enviados com proteção básica de input
        $loginInput = $this->request->getPost('login');
        $senhaInput = $this->request->getPost('senha');

        // Busca o usuário ativo no banco de dados SQLite
        $usuario = $model->where('login', $loginInput)
                         ->where('ativo', 1)
                         ->first();