app/Controllers/BolsistaController.php

SELECT *
FROM `bolsistas`
ORDER BY `nome` ASC
SELECT *
FROM `bolsistas_historico`
ORDER BY `_atualizado_em` DESC
---
    public function index()
    {
        $termo = trim((string) $this->request->getGet('nome'));

        $query = $this->bolsistaModel->orderBy('nome', 'ASC');

        if (!empty($termo)) {
            $query->like('nome', $termo);
        }

        $bolsistas = $query->findAll();

        // Carrega o histórico de alterações ordenado decrescente por _atualizado_em
        $db = \Config\Database::connect();
        $historicosRaw = $db->table('bolsistas_historico')
            ->orderBy('_atualizado_em', 'DESC')
            ->get()
            ->getResultArray();