app/Controllers/DashboardController.php

    public function index()
    {
        $bolsistaModel = new BolsistaModel();
        $professorModel = new ProfessorModel();

        $data = [
            'totalBolsistas'   => $bolsistaModel->countAllResults(), // Conta os bolsistas ativos no banco
            'totalProjetos'    => 0,
            'totalProfessores' => $professorModel->countAllResults(), // Conta os professores ativos no banco
            'saldoTotal'       => 0.00,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `bolsistas`
SELECT COUNT(*) AS `numrows`
FROM `professores`