app/Controllers/DespesaController.php

SELECT *
FROM `rubricas`
WHERE `id_projeto` = 72
---
    public function edit($id)
    {
        $despesa = $this->despesaModel->find($id);

        if (!$despesa) {
            return redirect()->to('/despesas')->with('erro', 'Despesa não encontrada.');
        }

        $data = [
            'titulo'   => 'Editar Despesa #' . $despesa['id_despesa'],
            'despesa'  => $despesa,
            'projetos' => $this->projetoModel->findAll(),
            'rubricas' => $this->rubricaModel->where('id_projeto', $despesa['id_projeto'])->findAll(),