app/Controllers/DespesaController.php

SELECT *
FROM `rubricas`
SELECT *
FROM `projetos`
SELECT *
FROM `despesas_historico`
ORDER BY `_atualizado_em` DESC
---
    public function index()
    {
        $despesas = $this->despesaModel->getDespesasComRelacionamentos();

        $db = \Config\Database::connect();

        // Mapeia rubricas para visualização histórica
        $rubricasRaw = $db->table('rubricas')->get()->getResultArray();
        $rubricasMap = [];
        foreach ($rubricasRaw as $r) {
            $rubricasMap[$r['id_rubrica']] = $r['nome'] . ' (' . $r['tipo'] . ')';
        }

        // Mapeia projetos para visualização histórica
        $projetosRaw = $db->table('projetos')->get()->getResultArray();
        $projetosMap = [];
        foreach ($projetosRaw as $p) {
            $projetosMap[$p['id_projeto']] = $p['codigo_projeto_fundacao'] . ' - ' . $p['titulo'];
        }

        // Histórico de alterações de despesas ordenado decrescente por _atualizado_em
        $historicosRaw = $db->table('despesas_historico')
            ->orderBy('_atualizado_em', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `projetos`
ORDER BY `titulo` ASC
---
    public function new()
    {


        /*
        Carrega as rubricas selecionadas caso haja um erro tipo valor acima do permitido
        Bug registrado em: 32 - Correção de Bug em Despesas
        */
        $idProjetoOld = old('id_projeto');
        $rubricas = [];

        if ($idProjetoOld) {
            $rubricas = $this->rubricaModel->where('id_projeto', $idProjetoOld)->orderBy('nome', 'ASC')->findAll();
        }

        /* Fim da correção */

        $data = [
            'titulo'   => 'Lançamento de Nova Despesa',
            'projetos' => $this->projetoModel->orderBy('titulo', 'ASC')->findAll(),

SELECT *
FROM `projetos`
ORDER BY `titulo` ASC
SELECT *
FROM `despesas`
WHERE `despesas`.`id_despesa` = '7'
SELECT *
FROM `anexos`
WHERE `id_despesa` = '7'
---
    public function edit($id)
    {
        $despesa = $this->despesaModel->find($id);

        if (!$despesa) {
            return redirect()->to('/despesas')->with('erro', 'Despesa não encontrada.');
        }

        $data = [
            'titulo'   => 'Editar Despesa #' . $despesa['id_despesa'],
            'despesa'  => $despesa,
            'projetos' => $this->projetoModel->orderBy('titulo', 'ASC')->findAll(),
            'rubricas' => $this->rubricaModel->where('id_projeto', $despesa['id_projeto'])->orderBy('nome', 'ASC')->findAll(),
            'anexos'   => $this->anexoModel->where('id_despesa', $id)->findAll()