app/Controllers/FundacaoController.php

SELECT *
FROM `fundacoes_historico`
ORDER BY `_atualizado_em` DESC
---
    public function index()
    {
        $fundacoes = $this->fundacaoModel->findAll();

        // Carrega o histórico de alterações ordenado decrescente por _atualizado_em
        $db = \Config\Database::connect();
        $historicosRaw = $db->table('fundacoes_historico')
            ->orderBy('_atualizado_em', 'DESC')
            ->get()
            ->getResultArray();