app/Controllers/FundacaoController.php

    public function index()
    {
        $data = [
            'titulo'    => 'Gerenciamento de Fundações',
            'fundacoes' => $this->fundacaoModel->findAll()
        ];
---
SELECT *
FROM `fundacoes`