app/Controllers/MovimentacaoRubricaController.php

    public function extrato($idRubrica)
    {
        $rubrica = $this->rubricaModel->find($idRubrica);
---
SELECT *
FROM `rubricas`
WHERE `rubricas`.`id_rubrica` = '1'