app/Controllers/ProfessorController.php

SELECT *
FROM `professores`
ORDER BY `nome` ASC
---
    public function index()
    {
        $data = [
            'titulo'    => 'Gerenciamento de Professores',
            'professores' => $this->professorModel->orderBy('nome', 'ASC')->findAll()
        ];