app/Controllers/ProfessorController.php

SELECT *
FROM `professores_historico`
ORDER BY `_atualizado_em` DESC
---
    public function index()
    {
        $termo = trim((string) $this->request->getGet('nome'));

        $query = $this->professorModel->orderBy('nome', 'ASC');

        if (!empty($termo)) {
            $query->like('nome', $termo);
        }

        $professores = $query->findAll();

        // Carrega o histórico de alterações ordenado decrescente por _atualizado_em
        $db = \Config\Database::connect();
        $historicosRaw = $db->table('professores_historico')
            ->orderBy('_atualizado_em', 'DESC')
            ->get()
            ->getResultArray();