app/Controllers/ProjetoController.php

SELECT *
FROM `projetos`
WHERE `projetos`.`id_projeto` = '1'
SELECT *
FROM `rubricas`
WHERE `id_projeto` = '2'
SELECT *
FROM `rubricas`
WHERE `id_projeto` = '1'
SELECT *
FROM `bolsistas`
---
    public function gerenciar($id)
    {
        $projeto = $this->projetoModel->find($id);

        if (!$projeto) {
            return redirect()->to('/projetos')->with('erro', 'Projeto não encontrado.');
        }

        $rubricaModel = new RubricaModel();
        $projetoBolsistaModel = new ProjetoBolsistaModel();
        $bolsistaModel = new BolsistaModel();

        $data = [
            'titulo'   => 'Painel do Projeto: ' . $projeto['codigo_projeto_fundacao'],
            'projeto'  => $projeto,
            'rubricas' => $rubricaModel->where('id_projeto', $id)->findAll(),
            'equipe'               => $projetoBolsistaModel->getBolsistasPorProjeto((int) $id),
            'bolsistas_disponiveis'=> $bolsistaModel->findAll() // Traz todos os bolsistas para o <select>
        ];