app/Controllers/ProjetoController.php

    public function index()
    {
        $projetos = $this->projetoModel->findAll();

        $db = \Config\Database::connect();

        // Professores para mapear os nomes
        $professoresRaw = $db->table('professores')->get()->getResultArray();
        $professoresMap = [];
        foreach ($professoresRaw as $p) {
            $professoresMap[$p['id_professor']] = $p['nome'];
        }

        // Fundações para mapear as siglas
        $fundacoesRaw = $db->table('fundacoes')->get()->getResultArray();
        $fundacoesMap = [];
        foreach ($fundacoesRaw as $f) {
            $fundacoesMap[$f['id_fundacao']] = $f['sigla'] . ' - ' . $f['nome'];
        }

        // Histórico de alterações ordenado decrescente por _atualizado_em
        $historicosRaw = $db->table('projetos_historico')
            ->orderBy('_atualizado_em', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `projetos`
SELECT *
FROM `professores`
SELECT *
FROM `fundacoes`
SELECT *
FROM `projetos_historico`
ORDER BY `_atualizado_em` DESC

            'data_fim'                => $this->request->getPost('data_fim'),
        ];

        if ($this->projetoModel->update($id, $dados)) {
---
UPDATE `projetos` SET `id_professor` = '9', `id_fundacao` = '3', `codigo_projeto_fundacao` = '60015140', `titulo` = 'Projeto X', `orcamento_total` = '1000000', `data_inicio` = '2026-08-23', `data_fim` = '2027-03-10', `_atualizado_por` = 'admin', `_atualizado_em` = '2026-08-31 13:23:26', `_operacao` = 'UPDATE'
WHERE `projetos`.`id_projeto` IN ('1')

    public function gerenciar($id)
    {
        $projeto = $this->projetoModel->find($id);

        if (!$projeto) {
            return redirect()->to('/projetos')->with('erro', 'Projeto não encontrado.');
        }

        $rubricaModel = new RubricaModel();
        $projetoBolsistaModel = new ProjetoBolsistaModel();
        $bolsistaModel = new BolsistaModel();

        $abaAtiva = $this->request->getGet('aba') ?? session()->getFlashdata('aba') ?? 'rubricas';
        $rubricas = $rubricaModel->where('id_projeto', $id)->findAll();

        $db = \Config\Database::connect();

        // Histórico de alterações de rubricas deste projeto ordenado decrescente por _atualizado_em
        $historicosRubricasRaw = $db->table('rubricas_historico')
            ->where('id_projeto', $id)
            ->orderBy('_atualizado_em', 'DESC')
            ->get()
            ->getResultArray();

        $historicosPorRubrica = [];
        foreach ($historicosRubricasRaw as $h) {
            $historicosPorRubrica[$h['id_rubrica']][] = $h;
        }

        // Histórico de alterações de vínculos de bolsistas deste projeto ordenado decrescente por _atualizado_em
        $historicosBolsistasRaw = $db->table('projetos_bolsistas_historico')
            ->where('id_projeto', $id)
            ->orderBy('_atualizado_em', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `projetos`
WHERE `projetos`.`id_projeto` = '2'
SELECT *
FROM `rubricas`
WHERE `id_projeto` = '2'
SELECT *
FROM `rubricas_historico`
WHERE `id_projeto` = '2'
ORDER BY `_atualizado_em` DESC
SELECT *
FROM `projetos_bolsistas_historico`
WHERE `id_projeto` = '2'
ORDER BY `_atualizado_em` DESC

        }

        // Mapeia nomes dos bolsistas para o histórico
        $bolsistasRaw = $db->table('bolsistas')->get()->getResultArray();
---
SELECT *
FROM `bolsistas`

            'equipe'                       => $projetoBolsistaModel->getBolsistasPorProjeto((int) $id),
            'historicosPorVinculoBolsista' => $historicosPorVinculoBolsista,
            'bolsistasMap'                 => $bolsistasMap,
            'bolsistas_disponiveis'        => $bolsistaModel->orderBy('nome', 'ASC')->findAll(), // Traz todos os bolsistas ordenados para o <select>
---
SELECT *
FROM `bolsistas`
ORDER BY `nome` ASC