app/Controllers/UsuarioController.php

    public function index()
    {
        $data = [
            'titulo'   => 'Gerenciamento de Usuários',
            'usuarios' => $this->usuarioModel->orderBy('id_usuario', 'ASC')->findAll()
---
SELECT *
FROM `usuarios`
ORDER BY `id_usuario` ASC