app/Models/DespesaModel.php

SELECT `d`.*, `p`.`codigo_projeto_fundacao`, `p`.`titulo` as `projeto_titulo`, `r`.`nome` as `rubrica_nome`, `r`.`tipo` as `rubrica_tipo`
FROM `despesas` `d`
LEFT JOIN `projetos` `p` ON `p`.`id_projeto` = `d`.`id_projeto`
LEFT JOIN `rubricas` `r` ON `r`.`id_rubrica` = `d`.`id_rubrica`
ORDER BY `d`.`data_emissao` DESC
---
    public function getDespesasComRelacionamentos(?int $idProjeto = null)
    {
        $builder = $this->db->table('despesas d')
            ->select('d.*, p.codigo_projeto_fundacao, p.titulo as projeto_titulo, r.nome as rubrica_nome, r.tipo as rubrica_tipo')
            ->join('projetos p', 'p.id_projeto = d.id_projeto', 'left')
            ->join('rubricas r', 'r.id_rubrica = d.id_rubrica', 'left')
            ->orderBy('d.data_emissao', 'DESC');

        if ($idProjeto) {
            $builder->where('d.id_projeto', $idProjeto);
        }

        return $builder->get()->getResultArray();