app/Models/ProjetoBolsistaModel.php

SELECT `pb`.*, `b`.`nome` as `bolsista_nome`, `b`.`cpf` as `bolsista_cpf`, `b`.`email` as `bolsista_email`
FROM `projetos_bolsistas` `pb`
LEFT JOIN `bolsistas` `b` ON `b`.`id_bolsista` = `pb`.`id_bolsista`
WHERE `pb`.`id_projeto` = 2
---
    public function getBolsistasPorProjeto(int $idProjeto)
    {
        return $this->db->table('projetos_bolsistas pb')
            ->select('pb.*, b.nome as bolsista_nome, b.cpf as bolsista_cpf, b.email as bolsista_email')
            ->join('bolsistas b', 'b.id_bolsista = pb.id_bolsista', 'left')
            ->where('pb.id_projeto', $idProjeto)
            ->get()
            ->getResultArray();