app/Libraries/AuditoriaConsistenciaService.php

    public function executarAuditoria(): array
    {
        $pendencias = [];
        $projetosComInconsistencia = [];

        // 1. Carrega todos os projetos
        $projetos = $this->db->table('projetos p')
            ->select('p.*, f.sigla as fundacao_sigla, f.nome as fundacao_nome, prof.nome as professor_nome')
            ->join('fundacoes f', 'f.id_fundacao = p.id_fundacao', 'left')
            ->join('professores prof', 'prof.id_professor = p.id_professor', 'left')
            ->orderBy('p.codigo_projeto_fundacao', 'ASC')
            ->get()
            ->getResultArray();

        $totalProjetos = count($projetos);

        // -------------------------------------------------------------
        // REGRA 1 & 2: Orçamento Total x Soma das Rubricas e Saldos
        // -------------------------------------------------------------
        foreach ($projetos as $proj) {
            $idProjeto = (int) $proj['id_projeto'];
            $codProj   = $proj['codigo_projeto_fundacao'];
            $orcamento = (float) $proj['orcamento_total'];

            $rubricas = $this->db->table('rubricas')
                ->where('id_projeto', $idProjeto)
                ->get()
                ->getResultArray();
---
SELECT *
FROM `rubricas`
WHERE `id_projeto` = 1