app/Libraries/AuditoriaConsistenciaService.php

    public function executarAuditoria(): array
    {
        $pendencias = [];
        $projetosComInconsistencia = [];

        // 1. Carrega todos os projetos
        $projetos = $this->db->table('projetos p')
            ->select('p.*, f.sigla as fundacao_sigla, f.nome as fundacao_nome, prof.nome as professor_nome')
            ->join('fundacoes f', 'f.id_fundacao = p.id_fundacao', 'left')
            ->join('professores prof', 'prof.id_professor = p.id_professor', 'left')
            ->orderBy('p.codigo_projeto_fundacao', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `p`.*, `f`.`sigla` as `fundacao_sigla`, `f`.`nome` as `fundacao_nome`, `prof`.`nome` as `professor_nome`
FROM `projetos` `p`
LEFT JOIN `fundacoes` `f` ON `f`.`id_fundacao` = `p`.`id_fundacao`
LEFT JOIN `professores` `prof` ON `prof`.`id_professor` = `p`.`id_professor`
ORDER BY `p`.`codigo_projeto_fundacao` ASC

                $projetosComInconsistencia[$idProjeto] = true;
            }

            $rubricas = $this->db->table('rubricas')
                ->where('id_projeto', $idProjeto)
                ->get()
                ->getResultArray();
---
SELECT *
FROM `rubricas`
WHERE `id_projeto` = 1

        // -------------------------------------------------------------
        // REGRA 3: Despesas Fora da Vigência do Projeto
        // -------------------------------------------------------------
        $despesasVigencia = $this->db->table('despesas d')
            ->select('d.*, p.codigo_projeto_fundacao, p.titulo as projeto_titulo, p.data_inicio as proj_inicio, p.data_fim as proj_fim')
            ->join('projetos p', 'p.id_projeto = d.id_projeto')
            ->where('(d.data_emissao < p.data_inicio OR d.data_emissao > p.data_fim)')
            ->get()
            ->getResultArray();
---
SELECT `d`.*, `p`.`codigo_projeto_fundacao`, `p`.`titulo` as `projeto_titulo`, `p`.`data_inicio` as `proj_inicio`, `p`.`data_fim` as `proj_fim`
FROM `despesas` `d`
JOIN `projetos` `p` ON `p`.`id_projeto` = `d`.`id_projeto`
WHERE (`d`.`data_emissao` < `p`.`data_inicio` OR `d`.`data_emissao` > `p`.`data_fim`)

        // -------------------------------------------------------------
        // REGRA 4: Despesas sem Comprovante / Anexo
        // -------------------------------------------------------------
        $despesasSemAnexo = $this->db->table('despesas d')
            ->select('d.*, p.codigo_projeto_fundacao, p.titulo as projeto_titulo')
            ->join('projetos p', 'p.id_projeto = d.id_projeto')
            ->join('anexos a', 'a.id_despesa = d.id_despesa', 'left')
            ->where('a.id_anexo IS NULL')
            ->get()
            ->getResultArray();
---
SELECT `d`.*, `p`.`codigo_projeto_fundacao`, `p`.`titulo` as `projeto_titulo`
FROM `despesas` `d`
JOIN `projetos` `p` ON `p`.`id_projeto` = `d`.`id_projeto`
LEFT JOIN `anexos` `a` ON `a`.`id_despesa` = `d`.`id_despesa`
WHERE `a`.`id_anexo` IS NULL

        // -------------------------------------------------------------
        // REGRA 5: Despesas em Análise (Aguardando Aprovação)
        // -------------------------------------------------------------
        $despesasEmAnalise = $this->db->table('despesas d')
            ->select('d.*, p.codigo_projeto_fundacao, p.titulo as projeto_titulo')
            ->join('projetos p', 'p.id_projeto = d.id_projeto')
            ->where('d.status_aprovacao', 'EM_ANALISE')
            ->get()
            ->getResultArray();
---
SELECT `d`.*, `p`.`codigo_projeto_fundacao`, `p`.`titulo` as `projeto_titulo`
FROM `despesas` `d`
JOIN `projetos` `p` ON `p`.`id_projeto` = `d`.`id_projeto`
WHERE `d`.`status_aprovacao` = 'EM_ANALISE'

        // -------------------------------------------------------------
        // REGRA 6: Bolsistas com Período de Bolsa Fora da Vigência do Projeto
        // -------------------------------------------------------------
        $bolsistasDesalinhados = $this->db->table('projetos_bolsistas pb')
            ->select('pb.*, b.nome as bolsista_nome, p.codigo_projeto_fundacao, p.titulo as projeto_titulo, p.data_inicio as proj_inicio, p.data_fim as proj_fim')
            ->join('bolsistas b', 'b.id_bolsista = pb.id_bolsista')
            ->join('projetos p', 'p.id_projeto = pb.id_projeto')
            ->where('(pb.data_inicio < p.data_inicio OR (pb.data_fim IS NOT NULL AND pb.data_fim > p.data_fim))')
            ->get()
            ->getResultArray();
---
SELECT `pb`.*, `b`.`nome` as `bolsista_nome`, `p`.`codigo_projeto_fundacao`, `p`.`titulo` as `projeto_titulo`, `p`.`data_inicio` as `proj_inicio`, `p`.`data_fim` as `proj_fim`
FROM `projetos_bolsistas` `pb`
JOIN `bolsistas` `b` ON `b`.`id_bolsista` = `pb`.`id_bolsista`
JOIN `projetos` `p` ON `p`.`id_projeto` = `pb`.`id_projeto`
WHERE (`pb`.`data_inicio` < `p`.`data_inicio` OR (`pb`.`data_fim` IS NOT NULL AND pb.data_fim > p.data_fim))

        // -------------------------------------------------------------
        // REGRA 7: Bolsista Cadastrado Mais de uma Vez no Mesmo Projeto (Duplicidade)
        // -------------------------------------------------------------
        $bolsistasDuplicados = $this->db->table('projetos_bolsistas pb')
            ->select('pb.id_projeto, pb.id_bolsista, b.nome as bolsista_nome, p.codigo_projeto_fundacao, p.titulo as projeto_titulo, COUNT(*) as qtd_cadastros')
            ->join('bolsistas b', 'b.id_bolsista = pb.id_bolsista')
            ->join('projetos p', 'p.id_projeto = pb.id_projeto')
            ->groupBy('pb.id_projeto, pb.id_bolsista')
            ->having('qtd_cadastros >', 1)
            ->get()
            ->getResultArray();
---
SELECT `pb`.`id_projeto`, `pb`.`id_bolsista`, `b`.`nome` as `bolsista_nome`, `p`.`codigo_projeto_fundacao`, `p`.`titulo` as `projeto_titulo`, COUNT(*) as qtd_cadastros
FROM `projetos_bolsistas` `pb`
JOIN `bolsistas` `b` ON `b`.`id_bolsista` = `pb`.`id_bolsista`
JOIN `projetos` `p` ON `p`.`id_projeto` = `pb`.`id_projeto`
GROUP BY `pb`.`id_projeto`, `pb`.`id_bolsista`
HAVING `qtd_cadastros` > 1